app/controllers/v1/images/images_controller.rb

SELECT `images`.* FROM `images` WHERE `images`.`id` = 25 LIMIT 1
---
      def show
        image = Image.find(params[:id])

INSERT INTO `images` (`elbow_plot`, `image`, `clustered_image`, `rgb_colours`, `hex_colours`, `num_clusters`, `created_at`, `updated_at`) VALUES (NULL, 'test', NULL, NULL, NULL, NULL, '2023-02-11 15:19:59.761302', '2023-02-11 15:19:59.761302')
---
      def create
        new_image = Image.new(image: 'test')
        new_image.image_file.attach(params[:file]) if params[:file]
        new_image.save!